brew "entr"            # Run arbitrary commands when files change
brew "jq"              # Lightweight and flexible command-line JSON processor
brew "htop"            # Fancier top
brew "fdupes"          # Find duplicate files
brew "unrar"           # for unraring things
brew "exiftool"        # for playing with pictures
brew "pv"              # pipeline viewer (shows how fast is the data moved around)
brew "ripgrep"         # faster grep
brew "poppler"         # pdfimages command line tool
brew "vim"             # To support termguicolors
brew "tesseract"       # for OCR
brew "tesseract-lang"  # for OCR
brew "findutils"       # Replacement for mac find
brew "mas"             # Mac App Store control tool
brew "broot"           # Terminal viewer
brew "fswatch"
brew "gnupg2"
brew "go"
brew "graphviz"
brew "openjdk"
brew "youtube-dl"
brew "gopass"
brew "ncdu"
brew "watch"
brew "irssi"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "imagemagick"
brew "ipython"
brew "pipenv"
brew "wget"
brew "tmux"
brew "gcc"
brew "rust"
brew "rustup-init"
brew "apktool"
brew "binwalk"
brew "nmap"
brew "mitmproxy"
brew "protobuf"
brew "qrencode"
brew "zbar"

# Backups & security utils
brew "restic"          # Backup tool
brew "syncthing", restart_service: :changed
brew "pass"

# Cross compiling
brew "FiloSottile/musl-cross/musl-cross", args: ["with-arm-hf"]

tap "homebrew/services"
brew "postgres", restart_service: :changed

tap "caskroom/cask"

cask "alfred"
cask "android-file-transfer"
cask "blender"
cask "dash"
cask "hammerspoon"
cask "inkscape"
cask "obsidian"
cask "signal"
cask "skype"
cask "spotify"
cask "telegram"
cask "typora"  # Markdown editor

mas "Flow", id: 1423210932        # Pomodoro timer

# QuickLook plugins
cask "qlstephen"           # default files
cask "qlcolorcode"         # syntax highlight
cask "qlimagesize"         # display image size
cask "qlmarkdown"          # render markdown
cask "suspicious-package"  # content of .pkg

# I don't like the Evernote 10 version, use the old pinned version
# https://cdn1.evernote.com/mac-smd/public/Evernote_RELEASE_7.14_458244.dmg
# cask "evernote"

# Already preinstalled packages:
#  - Firefox
#  - GIMP
#  - MacVim
#  - VLC media player
#  - Wireshark
#  - XQuartz
#  - iTerm2
#  - tmux
#  - Virtualbox and vagrant
#  - Sublime
